pages/homework.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cryptography</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Cryptography</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/8-CS-Cryptography">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="homework.html">Homework Tasks</a></li>

      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Implementing public key cryptography in Python</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-sec-1-1" class="outline-3 badge">
<h3 id="sec-1-1">Homework Task 1 - The Black Chamber</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For centuries, nations around the world have operated Black Chambers, secret rooms where they attempted to decode the messages being sent by their rivals. The French operated the Cabinet Noir, in Vienna the Geheime Kabinets-Kanzlei was the home of Austria's greatest codebreakers, and in Britain there was Room 40 and then Bletchley Park.
</p>

<p>
Go to <a href="http://www.simonsingh.net/The_Black_Chamber/chamberguide.html">http://www.simonsingh.net/The_Black_Chamber/chamberguide.html</a>
</p>

<p>
Write a brief report on the following three ciphers:
</p>
<ol class="org-ol">
<li>one transposition cipher, 
</li>
<li>one substitution cipher, and
</li>
<li>one advanced cipher.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3 badge">
<h3 id="sec-1-2">Homework Task 2 - Research: The One Time Pad(OTP) and the Enigma.</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Find out about both codes for example why is it the OTP the only mathematically unbreakable code? 
</li>
<li>Find out the history of the Enigma code. Here is a video to get you started. <a href="https://www.khanacademy.org/computing/computer-science/cryptography/crypt/v/one-time-pad">https://www.khanacademy.org/computing/computer-science/cryptography/crypt/v/one-time-pad</a> and
</li>

<li>Write 100 words on each.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 badge">
<h3 id="sec-1-3">Homework Task 3 - Caesar Cipher Challenges</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The Caesar shift cipher replaces every letter with the letter that is a fixed number of places further down the alphabet. For example if the shift is 2, then A is replaced with C, B with D, C with E and so on. Or if there is a shift of 5 then A is replaced with F, B with G, C with H and so on.
</p>

<ol class="org-ol">
<li>Easy:
</li>
</ol>

<p>
BZDRZQ’R VHED LTRS AD ZANUD RTROHBHNM
</p>

<ol class="org-ol">
<li>Medium:
</li>
</ol>

<p>
LWW RLFW TD OTGTOPO TYEZ ESCPP ALCED ZYP ZQ HSTNS ESP MPWRLP TYSLMTE ESP LBFTELYT LYZESPC ESZDP HSZ TY ESPTC ZHY WLYRFLRP LCP NLWWPO NPWED TY ZFC RLFWD ESP ESTCO LWW ESPDP OTQQPC QCZX PLNS ZESPC TY WLYRFLRP NFDEZXD LYO WLHD
</p>

<ol class="org-ol">
<li>Hard:
</li>
</ol>

<p>
KENKMOC PYBDEXK TEFKD
</p>

<ol class="org-ol">
<li>Bonus:
</li>
</ol>

<p>
MHILYLZAZBHLXBPZXBLMVYABUHLHWWPBZJSHBKPBZJH LJBZKPJABTHYJHUBTLZAULBAYVU
</p>

<p>
There are online deciphers but only use them when you are completely stuck!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
